import subprocess

print("started post gen project!")
# ---------------------------------------------------------------------------------------------------------------------------------------------------
# 1) conda env 생성 / 패키지 설치
# conda create -n 가상환경이름 python=버전
# ---------------------------------------------------------------------------------------------------------------------------------------------------
print("crate conda env and install packages...")
subprocess.call(['conda', 'env', 'create', '-f', 'export.yaml'])

# ---------------------------------------------------------------------------------------------------------------------------------------------------
# 2) git 초기화
# conda create -n 가상환경이름 python=버전
# ---------------------------------------------------------------------------------------------------------------------------------------------------
print("initialize git repo...")
subprocess.call(['git', 'init'])
subprocess.call(['git', 'add', '*'])
subprocess.call(['git', 'commit', '-m', 'Initial commit'])
print("finished post gen project!")
